Catalogs/ЛБ_ШаблоныПриказовПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ШаблоныПриказовПроцентныеСтавки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформацияПроцентныеСтавки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНачалаПрименения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_ШаблоныПриказовПроцентныеСтавки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИнформацияПроцентныеСтавки = ТекущийОбъект.ДопИнформацияПроцентныеСтавки.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДопИнформацияПроцентныеСтавки = Новый ХранилищеЗначения(ИнформацияПроцентныеСтавки);	
КонецПроцедуры 

&НаСервере
Процедура СвернутьТаблицу() 
	ТаблицаПроверки = Объект.СтавкиПроцентов.Выгрузить(); 
	ТаблицаПроверки.Свернуть("ПричинаПрименения, СтатусЗалогодателя, ДиапазонСумм, ДеньНачалаПрименения");  
	Объект.СтавкиПроцентов.Загрузить(ТаблицаПроверки);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	СвернутьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавок(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.СтавкиПроцентов.Очистить();
	Для каждого Стр0 Из Объект.СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл
		Для каждого Стр1 Из Результат.ДниНачалаПрименения Цикл
			Для каждого Стр2 Из Результат.СтатусыКлиентов Цикл
				Для каждого Стр3 Из Результат.ДиапазоныСумм Цикл
				    НоваяСтр = Объект.СтавкиПроцентов.Добавить();
					НоваяСтр.ПричинаПрименения = Стр0.ПричинаПрименения;
					НоваяСтр.ДеньНачалаПрименения = Стр1.ДеньНачалаПрименения;
					НоваяСтр.СтатусЗалогодателя = Стр2.Статус;
		            НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;				
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПроцентныхСтавок(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.СхемаКредитования) Тогда
		Сообщить("Не выбрана схема кредитования!");
		Возврат;
	КонецЕсли;	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавок",ЭтаФорма);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКредитования", Объект.СхемаКредитования);
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавок.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавокДобавить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Для каждого Стр0 Из Объект.СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл 
		Для каждого Стр1 Из Результат.ДниНачалаПрименения Цикл
			Для каждого Стр2 Из Результат.СтатусыКлиентов Цикл
				Для каждого Стр3 Из Результат.ДиапазоныСумм Цикл 
					Отбор = Новый Структура;
					Отбор.Вставить("ПричинаПрименения", Стр0.ПричинаПрименения);
					Отбор.Вставить("ДеньНачалаПрименения", Стр1.ДеньНачалаПрименения);
					Отбор.Вставить("СтатусЗалогодателя", Стр2.Статус);
					Отбор.Вставить("ДиапазонСумм", Стр3.ДиапазонСумм);
					
					Строки = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
					Если Строки.Количество() = 0 Тогда
					    НоваяСтр = Объект.СтавкиПроцентов.Добавить();
						НоваяСтр.ПричинаПрименения = Стр0.ПричинаПрименения; 
						НоваяСтр.ДеньНачалаПрименения = Стр1.ДеньНачалаПрименения;
						НоваяСтр.СтатусЗалогодателя = Стр2.Статус;
			            НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПроцентныхСтавок(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.СхемаКредитования) Тогда
		Сообщить("Не выбрана схема кредитования!");
		Возврат;
	КонецЕсли;	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавокДобавить",ЭтаФорма); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКредитования", Объект.СхемаКредитования);
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавок.Форма", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПричиныПримененияОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПричинаПрименения", Результат);
	СтрокиМ = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.СтавкиПроцентов.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоПричинеПрименения(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПричиныПримененияОчистить",ЭтаФорма);
    ОткрытьФорму("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтатусаКлиентаОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтатусЗалогодателя", Результат);
	СтрокиМ = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.СтавкиПроцентов.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоСтатусуКлиента(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСтатусаКлиентаОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_СтатусыЗалогодателей.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
